# IsSystemClassificationValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..IsSystemClassificationValid Method
ConnectorElement Class See Also
---
Checks that the MEPSystemType is valid for the domain of connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsSystemClassificationValid(
	MEPSystemClassification systemClassification
)
```

Visual Basic
---
```text
Public Function IsSystemClassificationValid ( _
	systemClassification As MEPSystemClassification _
) As Boolean
```

Visual C++
---
```text
public:
bool IsSystemClassificationValid(
	MEPSystemClassification systemClassification
)
```

# ### Parameters
systemClassification
    Type: Autodesk.Revit.DB..::..MEPSystemClassification The MEPSystemType to be validated.
# ### Return Value
True if the MEPSystemType is valid for the domain of the connector, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace